Laur59/uKOS-X-IWYU/Tools/TestRom/Pico2_rp2350_RV32IMAC/Includes/SOC/Registers/RP2350_accessctrl.h
/*
; RP2350_accessctrl.
; ==================

; SPDX-License-Identifier: MIT

;------------------------------------------------------------------------
; Author:   Generated using the .svd description    The 2025-01-01
; Modifs:
;
; Project:  uKOS-X
; Goal:     RP2350_accessctrl equates.
;
;   (c) 2025-2026, Edo. Franzi
;   --------------------------
;                                              __ ______  _____
;   Edo. Franzi                         __  __/ //_/ __ \/ ___/
;   5-Route de Cheseaux                / / / / ,< / / / /\__ \
;   CH 1400 Cheseaux-Noréaz           / /_/ / /| / /_/ /___/ /
;                                     \__,_/_/ |_\____//____/
;   edo.franzi@ukos.ch
;
;   Description: Lightweight, real-time multitasking operating
;   system for embedded microcontroller and DSP-based systems.
;
;   Permission is hereby granted, free of charge, to any person
;   obtaining a copy of this software and associated documentation
;   files (the "Software"), to deal in the Software without restriction,
;   including without limitation the rights to use, copy, modify,
;   merge, publish, distribute, sublicense, and/or sell copies of the
;   Software, and to permit persons to whom the Software is furnished
;   to do so, subject to the following conditions:
;
;   The above copyright notice and this permission notice shall be
;   included in all copies or substantial portions of the Software.
;
;   THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND,
;   EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
;   MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND
;   NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS
;   BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN
;   ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
;   CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
;   SOFTWARE.
;
;------------------------------------------------------------------------
*/

#pragma once

#include    <stdint.h>

// ACCESSCTRL address definitions
// ------------------------------

typedef struct {
    volatile    uint32_t    LOCK;
    volatile    uint32_t    FORCE_CORE_NS;
    volatile    uint32_t    CFGRESET;
    volatile    uint32_t    GPIO_NSMASK0;
    volatile    uint32_t    GPIO_NSMASK1;
    volatile    uint32_t    ROM;
    volatile    uint32_t    XIP_MAIN;
    volatile    uint32_t    SRAM0;
    volatile    uint32_t    SRAM1;
    volatile    uint32_t    SRAM2;
    volatile    uint32_t    SRAM3;
    volatile    uint32_t    SRAM4;
    volatile    uint32_t    SRAM5;
    volatile    uint32_t    SRAM6;
    volatile    uint32_t    SRAM7;
    volatile    uint32_t    SRAM8;
    volatile    uint32_t    SRAM9;
    volatile    uint32_t    DMA;
    volatile    uint32_t    USBCTRL;
    volatile    uint32_t    PIO0;
    volatile    uint32_t    PIO1;
    volatile    uint32_t    PIO2;
    volatile    uint32_t    CORESIGHT_TRACE;
    volatile    uint32_t    CORESIGHT_PERIPH;
    volatile    uint32_t    SYSINFO;
    volatile    uint32_t    RESETS;
    volatile    uint32_t    IO_BANK0;
    volatile    uint32_t    IO_BANK1;
    volatile    uint32_t    PADS_BANK0;
    volatile    uint32_t    PADS_QSPI;
    volatile    uint32_t    BUSCTRL;
    volatile    uint32_t    ADC0;
    volatile    uint32_t    HSTX;
    volatile    uint32_t    I2C0;
    volatile    uint32_t    I2C1;
    volatile    uint32_t    PWM;
    volatile    uint32_t    SPI0;
    volatile    uint32_t    SPI1;
    volatile    uint32_t    TIMER0;
    volatile    uint32_t    TIMER1;
    volatile    uint32_t    UART0;
    volatile    uint32_t    UART1;
    volatile    uint32_t    OTP;
    volatile    uint32_t    TBMAN;
    volatile    uint32_t    POWMAN;
    volatile    uint32_t    TRNG;
    volatile    uint32_t    SHA256;
    volatile    uint32_t    SYSCFG;
    volatile    uint32_t    CLOCKS;
    volatile    uint32_t    XOSC;
    volatile    uint32_t    ROSC;
    volatile    uint32_t    PLL_SYS;
    volatile    uint32_t    PLL_USB;
    volatile    uint32_t    TICKS;
    volatile    uint32_t    WATCHDOG;
    volatile    uint32_t    RSM;
    volatile    uint32_t    XIP_CTRL;
    volatile    uint32_t    XIP_QMI;
    volatile    uint32_t    XIP_AUX;
} ACCESSCTRL_TypeDef;

#ifdef __cplusplus
#define ACCESSCTRL_NS   reinterpret_cast<ACCESSCTRL_TypeDef *>(0x40060000U)
#define ACCESSCTRL_S    reinterpret_cast<ACCESSCTRL_TypeDef *>(0x40060000U)
#else
#define ACCESSCTRL_NS   ((ACCESSCTRL_TypeDef *)0x40060000U)
#define ACCESSCTRL_S    ((ACCESSCTRL_TypeDef *)0x40060000U)
#endif

// LOCK Configuration

#define ACCESSCTRL_LOCK_CORE0                   (0x1U<<0)
#define ACCESSCTRL_LOCK_CORE1                   (0x1U<<1)
#define ACCESSCTRL_LOCK_DMA                     (0x1U<<2)
#define ACCESSCTRL_LOCK_DEBUG                   (0x1U<<3)

// FORCE_CORE_NS Configuration

#define ACCESSCTRL_FORCE_CORE_NS_CORE1          (0x1U<<1)

// CFGRESET Configuration

#define ACCESSCTRL_CFGRESET_CFGRESET            (0x1U<<0)

// GPIO_NSMASK0 Configuration

#define ACCESSCTRL_GPIO_NSMASK0_GPIO_NSMASK0    (0xFFFFFFFFU<<0)
#define ACCESSCTRL_GPIO_NSMASK0_GPIO_NSMASK0_0  (0x1U<<0)

// GPIO_NSMASK1 Configuration

#define ACCESSCTRL_GPIO_NSMASK1_GPIO            (0xFFFFU<<0)
#define ACCESSCTRL_GPIO_NSMASK1_GPIO_0          (0x1U<<0)
#define ACCESSCTRL_GPIO_NSMASK1_USB_DP          (0x1U<<24)
#define ACCESSCTRL_GPIO_NSMASK1_USB_DM          (0x1U<<25)
#define ACCESSCTRL_GPIO_NSMASK1_QSPI_SCK        (0x1U<<26)
#define ACCESSCTRL_GPIO_NSMASK1_QSPI_CSN        (0x1U<<27)
#define ACCESSCTRL_GPIO_NSMASK1_QSPI_SD         (0xFU<<28)
#define ACCESSCTRL_GPIO_NSMASK1_QSPI_SD_0       (0x1U<<28)

// ROM Configuration

#define ACCESSCTRL_ROM_NSU                      (0x1U<<0)
#define ACCESSCTRL_ROM_NSP                      (0x1U<<1)
#define ACCESSCTRL_ROM_SU                       (0x1U<<2)
#define ACCESSCTRL_ROM_SP                       (0x1U<<3)
#define ACCESSCTRL_ROM_CORE0                    (0x1U<<4)
#define ACCESSCTRL_ROM_CORE1                    (0x1U<<5)
#define ACCESSCTRL_ROM_DMA                      (0x1U<<6)
#define ACCESSCTRL_ROM_DBG                      (0x1U<<7)

// XIP_MAIN Configuration

#define ACCESSCTRL_XIP_MAIN_NSU                 (0x1U<<0)
#define ACCESSCTRL_XIP_MAIN_NSP                 (0x1U<<1)
#define ACCESSCTRL_XIP_MAIN_SU                  (0x1U<<2)
#define ACCESSCTRL_XIP_MAIN_SP                  (0x1U<<3)
#define ACCESSCTRL_XIP_MAIN_CORE0               (0x1U<<4)
#define ACCESSCTRL_XIP_MAIN_CORE1               (0x1U<<5)
#define ACCESSCTRL_XIP_MAIN_DMA                 (0x1U<<6)
#define ACCESSCTRL_XIP_MAIN_DBG                 (0x1U<<7)

// SRAM0 Configuration

#define ACCESSCTRL_SRAM0_NSU                    (0x1U<<0)
#define ACCESSCTRL_SRAM0_NSP                    (0x1U<<1)
#define ACCESSCTRL_SRAM0_SU                     (0x1U<<2)
#define ACCESSCTRL_SRAM0_SP                     (0x1U<<3)
#define ACCESSCTRL_SRAM0_CORE0                  (0x1U<<4)
#define ACCESSCTRL_SRAM0_CORE1                  (0x1U<<5)
#define ACCESSCTRL_SRAM0_DMA                    (0x1U<<6)
#define ACCESSCTRL_SRAM0_DBG                    (0x1U<<7)

// SRAM1 Configuration

