Laur59/uKOS-X-IWYU/Tools/TestRom/Pico2_rp2350_RV32IMAC/Includes/SOC/Registers/RP2350_accessctrl.h
#define ACCESSCTRL_SRAM1_NSU                    (0x1U<<0)
#define ACCESSCTRL_SRAM1_NSP                    (0x1U<<1)
#define ACCESSCTRL_SRAM1_SU                     (0x1U<<2)
#define ACCESSCTRL_SRAM1_SP                     (0x1U<<3)
#define ACCESSCTRL_SRAM1_CORE0                  (0x1U<<4)
#define ACCESSCTRL_SRAM1_CORE1                  (0x1U<<5)
#define ACCESSCTRL_SRAM1_DMA                    (0x1U<<6)
#define ACCESSCTRL_SRAM1_DBG                    (0x1U<<7)

// SRAM2 Configuration

#define ACCESSCTRL_SRAM2_NSU                    (0x1U<<0)
#define ACCESSCTRL_SRAM2_NSP                    (0x1U<<1)
#define ACCESSCTRL_SRAM2_SU                     (0x1U<<2)
#define ACCESSCTRL_SRAM2_SP                     (0x1U<<3)
#define ACCESSCTRL_SRAM2_CORE0                  (0x1U<<4)
#define ACCESSCTRL_SRAM2_CORE1                  (0x1U<<5)
#define ACCESSCTRL_SRAM2_DMA                    (0x1U<<6)
#define ACCESSCTRL_SRAM2_DBG                    (0x1U<<7)

// SRAM3 Configuration

#define ACCESSCTRL_SRAM3_NSU                    (0x1U<<0)
#define ACCESSCTRL_SRAM3_NSP                    (0x1U<<1)
#define ACCESSCTRL_SRAM3_SU                     (0x1U<<2)
#define ACCESSCTRL_SRAM3_SP                     (0x1U<<3)
#define ACCESSCTRL_SRAM3_CORE0                  (0x1U<<4)
#define ACCESSCTRL_SRAM3_CORE1                  (0x1U<<5)
#define ACCESSCTRL_SRAM3_DMA                    (0x1U<<6)
#define ACCESSCTRL_SRAM3_DBG                    (0x1U<<7)

// SRAM4 Configuration

#define ACCESSCTRL_SRAM4_NSU                    (0x1U<<0)
#define ACCESSCTRL_SRAM4_NSP                    (0x1U<<1)
#define ACCESSCTRL_SRAM4_SU                     (0x1U<<2)
#define ACCESSCTRL_SRAM4_SP                     (0x1U<<3)
#define ACCESSCTRL_SRAM4_CORE0                  (0x1U<<4)
#define ACCESSCTRL_SRAM4_CORE1                  (0x1U<<5)
#define ACCESSCTRL_SRAM4_DMA                    (0x1U<<6)
#define ACCESSCTRL_SRAM4_DBG                    (0x1U<<7)

// SRAM5 Configuration

#define ACCESSCTRL_SRAM5_NSU                    (0x1U<<0)
#define ACCESSCTRL_SRAM5_NSP                    (0x1U<<1)
#define ACCESSCTRL_SRAM5_SU                     (0x1U<<2)
#define ACCESSCTRL_SRAM5_SP                     (0x1U<<3)
#define ACCESSCTRL_SRAM5_CORE0                  (0x1U<<4)
#define ACCESSCTRL_SRAM5_CORE1                  (0x1U<<5)
#define ACCESSCTRL_SRAM5_DMA                    (0x1U<<6)
#define ACCESSCTRL_SRAM5_DBG                    (0x1U<<7)

// SRAM6 Configuration

#define ACCESSCTRL_SRAM6_NSU                    (0x1U<<0)
#define ACCESSCTRL_SRAM6_NSP                    (0x1U<<1)
#define ACCESSCTRL_SRAM6_SU                     (0x1U<<2)
#define ACCESSCTRL_SRAM6_SP                     (0x1U<<3)
#define ACCESSCTRL_SRAM6_CORE0                  (0x1U<<4)
#define ACCESSCTRL_SRAM6_CORE1                  (0x1U<<5)
#define ACCESSCTRL_SRAM6_DMA                    (0x1U<<6)
#define ACCESSCTRL_SRAM6_DBG                    (0x1U<<7)

// SRAM7 Configuration

#define ACCESSCTRL_SRAM7_NSU                    (0x1U<<0)
#define ACCESSCTRL_SRAM7_NSP                    (0x1U<<1)
#define ACCESSCTRL_SRAM7_SU                     (0x1U<<2)
#define ACCESSCTRL_SRAM7_SP                     (0x1U<<3)
#define ACCESSCTRL_SRAM7_CORE0                  (0x1U<<4)
#define ACCESSCTRL_SRAM7_CORE1                  (0x1U<<5)
#define ACCESSCTRL_SRAM7_DMA                    (0x1U<<6)
#define ACCESSCTRL_SRAM7_DBG                    (0x1U<<7)

// SRAM8 Configuration

#define ACCESSCTRL_SRAM8_NSU                    (0x1U<<0)
#define ACCESSCTRL_SRAM8_NSP                    (0x1U<<1)
#define ACCESSCTRL_SRAM8_SU                     (0x1U<<2)
#define ACCESSCTRL_SRAM8_SP                     (0x1U<<3)
#define ACCESSCTRL_SRAM8_CORE0                  (0x1U<<4)
#define ACCESSCTRL_SRAM8_CORE1                  (0x1U<<5)
#define ACCESSCTRL_SRAM8_DMA                    (0x1U<<6)
#define ACCESSCTRL_SRAM8_DBG                    (0x1U<<7)

// SRAM9 Configuration

#define ACCESSCTRL_SRAM9_NSU                    (0x1U<<0)
#define ACCESSCTRL_SRAM9_NSP                    (0x1U<<1)
#define ACCESSCTRL_SRAM9_SU                     (0x1U<<2)
#define ACCESSCTRL_SRAM9_SP                     (0x1U<<3)
#define ACCESSCTRL_SRAM9_CORE0                  (0x1U<<4)
#define ACCESSCTRL_SRAM9_CORE1                  (0x1U<<5)
#define ACCESSCTRL_SRAM9_DMA                    (0x1U<<6)
#define ACCESSCTRL_SRAM9_DBG                    (0x1U<<7)

// DMA Configuration

#define ACCESSCTRL_DMA_NSU                      (0x1U<<0)
#define ACCESSCTRL_DMA_NSP                      (0x1U<<1)
#define ACCESSCTRL_DMA_SU                       (0x1U<<2)
#define ACCESSCTRL_DMA_SP                       (0x1U<<3)
#define ACCESSCTRL_DMA_CORE0                    (0x1U<<4)
#define ACCESSCTRL_DMA_CORE1                    (0x1U<<5)
#define ACCESSCTRL_DMA_DMA                      (0x1U<<6)
#define ACCESSCTRL_DMA_DBG                      (0x1U<<7)

// USBCTRL Configuration

#define ACCESSCTRL_USBCTRL_NSU                  (0x1U<<0)
#define ACCESSCTRL_USBCTRL_NSP                  (0x1U<<1)
#define ACCESSCTRL_USBCTRL_SU                   (0x1U<<2)
#define ACCESSCTRL_USBCTRL_SP                   (0x1U<<3)
#define ACCESSCTRL_USBCTRL_CORE0                (0x1U<<4)
#define ACCESSCTRL_USBCTRL_CORE1                (0x1U<<5)
#define ACCESSCTRL_USBCTRL_DMA                  (0x1U<<6)
#define ACCESSCTRL_USBCTRL_DBG                  (0x1U<<7)

// PIO0 Configuration

#define ACCESSCTRL_PIO0_NSU                     (0x1U<<0)
#define ACCESSCTRL_PIO0_NSP                     (0x1U<<1)
#define ACCESSCTRL_PIO0_SU                      (0x1U<<2)
#define ACCESSCTRL_PIO0_SP                      (0x1U<<3)
#define ACCESSCTRL_PIO0_CORE0                   (0x1U<<4)
#define ACCESSCTRL_PIO0_CORE1                   (0x1U<<5)
#define ACCESSCTRL_PIO0_DMA                     (0x1U<<6)
#define ACCESSCTRL_PIO0_DBG                     (0x1U<<7)

// PIO1 Configuration

#define ACCESSCTRL_PIO1_NSU                     (0x1U<<0)
#define ACCESSCTRL_PIO1_NSP                     (0x1U<<1)
#define ACCESSCTRL_PIO1_SU                      (0x1U<<2)
#define ACCESSCTRL_PIO1_SP                      (0x1U<<3)
#define ACCESSCTRL_PIO1_CORE0                   (0x1U<<4)
#define ACCESSCTRL_PIO1_CORE1                   (0x1U<<5)
#define ACCESSCTRL_PIO1_DMA                     (0x1U<<6)
#define ACCESSCTRL_PIO1_DBG                     (0x1U<<7)

// PIO2 Configuration

#define ACCESSCTRL_PIO2_NSU                     (0x1U<<0)
#define ACCESSCTRL_PIO2_NSP                     (0x1U<<1)
#define ACCESSCTRL_PIO2_SU                      (0x1U<<2)
#define ACCESSCTRL_PIO2_SP                      (0x1U<<3)
#define ACCESSCTRL_PIO2_CORE0                   (0x1U<<4)
#define ACCESSCTRL_PIO2_CORE1                   (0x1U<<5)
#define ACCESSCTRL_PIO2_DMA                     (0x1U<<6)
#define ACCESSCTRL_PIO2_DBG                     (0x1U<<7)

// CORESIGHT_TRACE Configuration

#define ACCESSCTRL_CORESIGHT_TRACE_NSU          (0x1U<<0)
#define ACCESSCTRL_CORESIGHT_TRACE_NSP          (0x1U<<1)
#define ACCESSCTRL_CORESIGHT_TRACE_SU           (0x1U<<2)
#define ACCESSCTRL_CORESIGHT_TRACE_SP           (0x1U<<3)
#define ACCESSCTRL_CORESIGHT_TRACE_CORE0        (0x1U<<4)
#define ACCESSCTRL_CORESIGHT_TRACE_CORE1        (0x1U<<5)
#define ACCESSCTRL_CORESIGHT_TRACE_DMA          (0x1U<<6)
#define ACCESSCTRL_CORESIGHT_TRACE_DBG          (0x1U<<7)

// CORESIGHT_PERIPH Configuration

