Laur59/uKOS-X-IWYU/Tools/TestRom/Pico2_rp2350_RV32IMAC/Includes/SOC/Registers/RP2350_accessctrl.h
#define ACCESSCTRL_CORESIGHT_PERIPH_NSU         (0x1U<<0)
#define ACCESSCTRL_CORESIGHT_PERIPH_NSP         (0x1U<<1)
#define ACCESSCTRL_CORESIGHT_PERIPH_SU          (0x1U<<2)
#define ACCESSCTRL_CORESIGHT_PERIPH_SP          (0x1U<<3)
#define ACCESSCTRL_CORESIGHT_PERIPH_CORE0       (0x1U<<4)
#define ACCESSCTRL_CORESIGHT_PERIPH_CORE1       (0x1U<<5)
#define ACCESSCTRL_CORESIGHT_PERIPH_DMA         (0x1U<<6)
#define ACCESSCTRL_CORESIGHT_PERIPH_DBG         (0x1U<<7)

// SYSINFO Configuration

#define ACCESSCTRL_SYSINFO_NSU                  (0x1U<<0)
#define ACCESSCTRL_SYSINFO_NSP                  (0x1U<<1)
#define ACCESSCTRL_SYSINFO_SU                   (0x1U<<2)
#define ACCESSCTRL_SYSINFO_SP                   (0x1U<<3)
#define ACCESSCTRL_SYSINFO_CORE0                (0x1U<<4)
#define ACCESSCTRL_SYSINFO_CORE1                (0x1U<<5)
#define ACCESSCTRL_SYSINFO_DMA                  (0x1U<<6)
#define ACCESSCTRL_SYSINFO_DBG                  (0x1U<<7)

// RESETS Configuration

#define ACCESSCTRL_RESETS_NSU                   (0x1U<<0)
#define ACCESSCTRL_RESETS_NSP                   (0x1U<<1)
#define ACCESSCTRL_RESETS_SU                    (0x1U<<2)
#define ACCESSCTRL_RESETS_SP                    (0x1U<<3)
#define ACCESSCTRL_RESETS_CORE0                 (0x1U<<4)
#define ACCESSCTRL_RESETS_CORE1                 (0x1U<<5)
#define ACCESSCTRL_RESETS_DMA                   (0x1U<<6)
#define ACCESSCTRL_RESETS_DBG                   (0x1U<<7)

// IO_BANK0 Configuration

#define ACCESSCTRL_IO_BANK0_NSU                 (0x1U<<0)
#define ACCESSCTRL_IO_BANK0_NSP                 (0x1U<<1)
#define ACCESSCTRL_IO_BANK0_SU                  (0x1U<<2)
#define ACCESSCTRL_IO_BANK0_SP                  (0x1U<<3)
#define ACCESSCTRL_IO_BANK0_CORE0               (0x1U<<4)
#define ACCESSCTRL_IO_BANK0_CORE1               (0x1U<<5)
#define ACCESSCTRL_IO_BANK0_DMA                 (0x1U<<6)
#define ACCESSCTRL_IO_BANK0_DBG                 (0x1U<<7)

// IO_BANK1 Configuration

#define ACCESSCTRL_IO_BANK1_NSU                 (0x1U<<0)
#define ACCESSCTRL_IO_BANK1_NSP                 (0x1U<<1)
#define ACCESSCTRL_IO_BANK1_SU                  (0x1U<<2)
#define ACCESSCTRL_IO_BANK1_SP                  (0x1U<<3)
#define ACCESSCTRL_IO_BANK1_CORE0               (0x1U<<4)
#define ACCESSCTRL_IO_BANK1_CORE1               (0x1U<<5)
#define ACCESSCTRL_IO_BANK1_DMA                 (0x1U<<6)
#define ACCESSCTRL_IO_BANK1_DBG                 (0x1U<<7)

// PADS_BANK0 Configuration

#define ACCESSCTRL_PADS_BANK0_NSU               (0x1U<<0)
#define ACCESSCTRL_PADS_BANK0_NSP               (0x1U<<1)
#define ACCESSCTRL_PADS_BANK0_SU                (0x1U<<2)
#define ACCESSCTRL_PADS_BANK0_SP                (0x1U<<3)
#define ACCESSCTRL_PADS_BANK0_CORE0             (0x1U<<4)
#define ACCESSCTRL_PADS_BANK0_CORE1             (0x1U<<5)
#define ACCESSCTRL_PADS_BANK0_DMA               (0x1U<<6)
#define ACCESSCTRL_PADS_BANK0_DBG               (0x1U<<7)

// PADS_QSPI Configuration

#define ACCESSCTRL_PADS_QSPI_NSU                (0x1U<<0)
#define ACCESSCTRL_PADS_QSPI_NSP                (0x1U<<1)
#define ACCESSCTRL_PADS_QSPI_SU                 (0x1U<<2)
#define ACCESSCTRL_PADS_QSPI_SP                 (0x1U<<3)
#define ACCESSCTRL_PADS_QSPI_CORE0              (0x1U<<4)
#define ACCESSCTRL_PADS_QSPI_CORE1              (0x1U<<5)
#define ACCESSCTRL_PADS_QSPI_DMA                (0x1U<<6)
#define ACCESSCTRL_PADS_QSPI_DBG                (0x1U<<7)

// BUSCTRL Configuration

#define ACCESSCTRL_BUSCTRL_NSU                  (0x1U<<0)
#define ACCESSCTRL_BUSCTRL_NSP                  (0x1U<<1)
#define ACCESSCTRL_BUSCTRL_SU                   (0x1U<<2)
#define ACCESSCTRL_BUSCTRL_SP                   (0x1U<<3)
#define ACCESSCTRL_BUSCTRL_CORE0                (0x1U<<4)
#define ACCESSCTRL_BUSCTRL_CORE1                (0x1U<<5)
#define ACCESSCTRL_BUSCTRL_DMA                  (0x1U<<6)
#define ACCESSCTRL_BUSCTRL_DBG                  (0x1U<<7)

// ADC0 Configuration

#define ACCESSCTRL_ADC0_NSU                     (0x1U<<0)
#define ACCESSCTRL_ADC0_NSP                     (0x1U<<1)
#define ACCESSCTRL_ADC0_SU                      (0x1U<<2)
#define ACCESSCTRL_ADC0_SP                      (0x1U<<3)
#define ACCESSCTRL_ADC0_CORE0                   (0x1U<<4)
#define ACCESSCTRL_ADC0_CORE1                   (0x1U<<5)
#define ACCESSCTRL_ADC0_DMA                     (0x1U<<6)
#define ACCESSCTRL_ADC0_DBG                     (0x1U<<7)

// HSTX Configuration

#define ACCESSCTRL_HSTX_NSU                     (0x1U<<0)
#define ACCESSCTRL_HSTX_NSP                     (0x1U<<1)
#define ACCESSCTRL_HSTX_SU                      (0x1U<<2)
#define ACCESSCTRL_HSTX_SP                      (0x1U<<3)
#define ACCESSCTRL_HSTX_CORE0                   (0x1U<<4)
#define ACCESSCTRL_HSTX_CORE1                   (0x1U<<5)
#define ACCESSCTRL_HSTX_DMA                     (0x1U<<6)
#define ACCESSCTRL_HSTX_DBG                     (0x1U<<7)

// I2C0 Configuration

#define ACCESSCTRL_I2C0_NSU                     (0x1U<<0)
#define ACCESSCTRL_I2C0_NSP                     (0x1U<<1)
#define ACCESSCTRL_I2C0_SU                      (0x1U<<2)
#define ACCESSCTRL_I2C0_SP                      (0x1U<<3)
#define ACCESSCTRL_I2C0_CORE0                   (0x1U<<4)
#define ACCESSCTRL_I2C0_CORE1                   (0x1U<<5)
#define ACCESSCTRL_I2C0_DMA                     (0x1U<<6)
#define ACCESSCTRL_I2C0_DBG                     (0x1U<<7)

// I2C1 Configuration

#define ACCESSCTRL_I2C1_NSU                     (0x1U<<0)
#define ACCESSCTRL_I2C1_NSP                     (0x1U<<1)
#define ACCESSCTRL_I2C1_SU                      (0x1U<<2)
#define ACCESSCTRL_I2C1_SP                      (0x1U<<3)
#define ACCESSCTRL_I2C1_CORE0                   (0x1U<<4)
#define ACCESSCTRL_I2C1_CORE1                   (0x1U<<5)
#define ACCESSCTRL_I2C1_DMA                     (0x1U<<6)
#define ACCESSCTRL_I2C1_DBG                     (0x1U<<7)

// PWM Configuration

#define ACCESSCTRL_PWM_NSU                      (0x1U<<0)
#define ACCESSCTRL_PWM_NSP                      (0x1U<<1)
#define ACCESSCTRL_PWM_SU                       (0x1U<<2)
#define ACCESSCTRL_PWM_SP                       (0x1U<<3)
#define ACCESSCTRL_PWM_CORE0                    (0x1U<<4)
#define ACCESSCTRL_PWM_CORE1                    (0x1U<<5)
#define ACCESSCTRL_PWM_DMA                      (0x1U<<6)
#define ACCESSCTRL_PWM_DBG                      (0x1U<<7)

// SPI0 Configuration

