Laur59/uKOS-X-IWYU/Tools/TestRom/Pico2_rp2350_RV32IMAC/Includes/SOC/Registers/RP2350_accessctrl.h
#define ACCESSCTRL_SPI0_NSU                     (0x1U<<0)
#define ACCESSCTRL_SPI0_NSP                     (0x1U<<1)
#define ACCESSCTRL_SPI0_SU                      (0x1U<<2)
#define ACCESSCTRL_SPI0_SP                      (0x1U<<3)
#define ACCESSCTRL_SPI0_CORE0                   (0x1U<<4)
#define ACCESSCTRL_SPI0_CORE1                   (0x1U<<5)
#define ACCESSCTRL_SPI0_DMA                     (0x1U<<6)
#define ACCESSCTRL_SPI0_DBG                     (0x1U<<7)

// SPI1 Configuration

#define ACCESSCTRL_SPI1_NSU                     (0x1U<<0)
#define ACCESSCTRL_SPI1_NSP                     (0x1U<<1)
#define ACCESSCTRL_SPI1_SU                      (0x1U<<2)
#define ACCESSCTRL_SPI1_SP                      (0x1U<<3)
#define ACCESSCTRL_SPI1_CORE0                   (0x1U<<4)
#define ACCESSCTRL_SPI1_CORE1                   (0x1U<<5)
#define ACCESSCTRL_SPI1_DMA                     (0x1U<<6)
#define ACCESSCTRL_SPI1_DBG                     (0x1U<<7)

// TIMER0 Configuration

#define ACCESSCTRL_TIMER0_NSU                   (0x1U<<0)
#define ACCESSCTRL_TIMER0_NSP                   (0x1U<<1)
#define ACCESSCTRL_TIMER0_SU                    (0x1U<<2)
#define ACCESSCTRL_TIMER0_SP                    (0x1U<<3)
#define ACCESSCTRL_TIMER0_CORE0                 (0x1U<<4)
#define ACCESSCTRL_TIMER0_CORE1                 (0x1U<<5)
#define ACCESSCTRL_TIMER0_DMA                   (0x1U<<6)
#define ACCESSCTRL_TIMER0_DBG                   (0x1U<<7)

// TIMER1 Configuration

#define ACCESSCTRL_TIMER1_NSU                   (0x1U<<0)
#define ACCESSCTRL_TIMER1_NSP                   (0x1U<<1)
#define ACCESSCTRL_TIMER1_SU                    (0x1U<<2)
#define ACCESSCTRL_TIMER1_SP                    (0x1U<<3)
#define ACCESSCTRL_TIMER1_CORE0                 (0x1U<<4)
#define ACCESSCTRL_TIMER1_CORE1                 (0x1U<<5)
#define ACCESSCTRL_TIMER1_DMA                   (0x1U<<6)
#define ACCESSCTRL_TIMER1_DBG                   (0x1U<<7)

// UART0 Configuration

#define ACCESSCTRL_UART0_NSU                    (0x1U<<0)
#define ACCESSCTRL_UART0_NSP                    (0x1U<<1)
#define ACCESSCTRL_UART0_SU                     (0x1U<<2)
#define ACCESSCTRL_UART0_SP                     (0x1U<<3)
#define ACCESSCTRL_UART0_CORE0                  (0x1U<<4)
#define ACCESSCTRL_UART0_CORE1                  (0x1U<<5)
#define ACCESSCTRL_UART0_DMA                    (0x1U<<6)
#define ACCESSCTRL_UART0_DBG                    (0x1U<<7)

// UART1 Configuration

#define ACCESSCTRL_UART1_NSU                    (0x1U<<0)
#define ACCESSCTRL_UART1_NSP                    (0x1U<<1)
#define ACCESSCTRL_UART1_SU                     (0x1U<<2)
#define ACCESSCTRL_UART1_SP                     (0x1U<<3)
#define ACCESSCTRL_UART1_CORE0                  (0x1U<<4)
#define ACCESSCTRL_UART1_CORE1                  (0x1U<<5)
#define ACCESSCTRL_UART1_DMA                    (0x1U<<6)
#define ACCESSCTRL_UART1_DBG                    (0x1U<<7)

// OTP Configuration

#define ACCESSCTRL_OTP_NSU                      (0x1U<<0)
#define ACCESSCTRL_OTP_NSP                      (0x1U<<1)
#define ACCESSCTRL_OTP_SU                       (0x1U<<2)
#define ACCESSCTRL_OTP_SP                       (0x1U<<3)
#define ACCESSCTRL_OTP_CORE0                    (0x1U<<4)
#define ACCESSCTRL_OTP_CORE1                    (0x1U<<5)
#define ACCESSCTRL_OTP_DMA                      (0x1U<<6)
#define ACCESSCTRL_OTP_DBG                      (0x1U<<7)

// TBMAN Configuration

#define ACCESSCTRL_TBMAN_NSU                    (0x1U<<0)
#define ACCESSCTRL_TBMAN_NSP                    (0x1U<<1)
#define ACCESSCTRL_TBMAN_SU                     (0x1U<<2)
#define ACCESSCTRL_TBMAN_SP                     (0x1U<<3)
#define ACCESSCTRL_TBMAN_CORE0                  (0x1U<<4)
#define ACCESSCTRL_TBMAN_CORE1                  (0x1U<<5)
#define ACCESSCTRL_TBMAN_DMA                    (0x1U<<6)
#define ACCESSCTRL_TBMAN_DBG                    (0x1U<<7)

// POWMAN Configuration

#define ACCESSCTRL_POWMAN_NSU                   (0x1U<<0)
#define ACCESSCTRL_POWMAN_NSP                   (0x1U<<1)
#define ACCESSCTRL_POWMAN_SU                    (0x1U<<2)
#define ACCESSCTRL_POWMAN_SP                    (0x1U<<3)
#define ACCESSCTRL_POWMAN_CORE0                 (0x1U<<4)
#define ACCESSCTRL_POWMAN_CORE1                 (0x1U<<5)
#define ACCESSCTRL_POWMAN_DMA                   (0x1U<<6)
#define ACCESSCTRL_POWMAN_DBG                   (0x1U<<7)

// TRNG Configuration

#define ACCESSCTRL_TRNG_NSU                     (0x1U<<0)
#define ACCESSCTRL_TRNG_NSP                     (0x1U<<1)
#define ACCESSCTRL_TRNG_SU                      (0x1U<<2)
#define ACCESSCTRL_TRNG_SP                      (0x1U<<3)
#define ACCESSCTRL_TRNG_CORE0                   (0x1U<<4)
#define ACCESSCTRL_TRNG_CORE1                   (0x1U<<5)
#define ACCESSCTRL_TRNG_DMA                     (0x1U<<6)
#define ACCESSCTRL_TRNG_DBG                     (0x1U<<7)

// SHA256 Configuration

#define ACCESSCTRL_SHA256_NSU                   (0x1U<<0)
#define ACCESSCTRL_SHA256_NSP                   (0x1U<<1)
#define ACCESSCTRL_SHA256_SU                    (0x1U<<2)
#define ACCESSCTRL_SHA256_SP                    (0x1U<<3)
#define ACCESSCTRL_SHA256_CORE0                 (0x1U<<4)
#define ACCESSCTRL_SHA256_CORE1                 (0x1U<<5)
#define ACCESSCTRL_SHA256_DMA                   (0x1U<<6)
#define ACCESSCTRL_SHA256_DBG                   (0x1U<<7)

// SYSCFG Configuration

#define ACCESSCTRL_SYSCFG_NSU                   (0x1U<<0)
#define ACCESSCTRL_SYSCFG_NSP                   (0x1U<<1)
#define ACCESSCTRL_SYSCFG_SU                    (0x1U<<2)
#define ACCESSCTRL_SYSCFG_SP                    (0x1U<<3)
#define ACCESSCTRL_SYSCFG_CORE0                 (0x1U<<4)
#define ACCESSCTRL_SYSCFG_CORE1                 (0x1U<<5)
#define ACCESSCTRL_SYSCFG_DMA                   (0x1U<<6)
#define ACCESSCTRL_SYSCFG_DBG                   (0x1U<<7)

// CLOCKS Configuration

#define ACCESSCTRL_CLOCKS_NSU                   (0x1U<<0)
#define ACCESSCTRL_CLOCKS_NSP                   (0x1U<<1)
#define ACCESSCTRL_CLOCKS_SU                    (0x1U<<2)
#define ACCESSCTRL_CLOCKS_SP                    (0x1U<<3)
#define ACCESSCTRL_CLOCKS_CORE0                 (0x1U<<4)
#define ACCESSCTRL_CLOCKS_CORE1                 (0x1U<<5)
#define ACCESSCTRL_CLOCKS_DMA                   (0x1U<<6)
#define ACCESSCTRL_CLOCKS_DBG                   (0x1U<<7)

