Laur59/uKOS-X-IWYU/Tools/TestRom/Pico2_rp2350_RV32IMAC/Includes/SOC/Registers/RP2350_accessctrl.h
// XOSC Configuration

#define ACCESSCTRL_XOSC_NSU                     (0x1U<<0)
#define ACCESSCTRL_XOSC_NSP                     (0x1U<<1)
#define ACCESSCTRL_XOSC_SU                      (0x1U<<2)
#define ACCESSCTRL_XOSC_SP                      (0x1U<<3)
#define ACCESSCTRL_XOSC_CORE0                   (0x1U<<4)
#define ACCESSCTRL_XOSC_CORE1                   (0x1U<<5)
#define ACCESSCTRL_XOSC_DMA                     (0x1U<<6)
#define ACCESSCTRL_XOSC_DBG                     (0x1U<<7)

// ROSC Configuration

#define ACCESSCTRL_ROSC_NSU                     (0x1U<<0)
#define ACCESSCTRL_ROSC_NSP                     (0x1U<<1)
#define ACCESSCTRL_ROSC_SU                      (0x1U<<2)
#define ACCESSCTRL_ROSC_SP                      (0x1U<<3)
#define ACCESSCTRL_ROSC_CORE0                   (0x1U<<4)
#define ACCESSCTRL_ROSC_CORE1                   (0x1U<<5)
#define ACCESSCTRL_ROSC_DMA                     (0x1U<<6)
#define ACCESSCTRL_ROSC_DBG                     (0x1U<<7)

// PLL_SYS Configuration

#define ACCESSCTRL_PLL_SYS_NSU                  (0x1U<<0)
#define ACCESSCTRL_PLL_SYS_NSP                  (0x1U<<1)
#define ACCESSCTRL_PLL_SYS_SU                   (0x1U<<2)
#define ACCESSCTRL_PLL_SYS_SP                   (0x1U<<3)
#define ACCESSCTRL_PLL_SYS_CORE0                (0x1U<<4)
#define ACCESSCTRL_PLL_SYS_CORE1                (0x1U<<5)
#define ACCESSCTRL_PLL_SYS_DMA                  (0x1U<<6)
#define ACCESSCTRL_PLL_SYS_DBG                  (0x1U<<7)

// PLL_USB Configuration

#define ACCESSCTRL_PLL_USB_NSU                  (0x1U<<0)
#define ACCESSCTRL_PLL_USB_NSP                  (0x1U<<1)
#define ACCESSCTRL_PLL_USB_SU                   (0x1U<<2)
#define ACCESSCTRL_PLL_USB_SP                   (0x1U<<3)
#define ACCESSCTRL_PLL_USB_CORE0                (0x1U<<4)
#define ACCESSCTRL_PLL_USB_CORE1                (0x1U<<5)
#define ACCESSCTRL_PLL_USB_DMA                  (0x1U<<6)
#define ACCESSCTRL_PLL_USB_DBG                  (0x1U<<7)

// TICKS Configuration

#define ACCESSCTRL_TICKS_NSU                    (0x1U<<0)
#define ACCESSCTRL_TICKS_NSP                    (0x1U<<1)
#define ACCESSCTRL_TICKS_SU                     (0x1U<<2)
#define ACCESSCTRL_TICKS_SP                     (0x1U<<3)
#define ACCESSCTRL_TICKS_CORE0                  (0x1U<<4)
#define ACCESSCTRL_TICKS_CORE1                  (0x1U<<5)
#define ACCESSCTRL_TICKS_DMA                    (0x1U<<6)
#define ACCESSCTRL_TICKS_DBG                    (0x1U<<7)

// WATCHDOG Configuration

#define ACCESSCTRL_WATCHDOG_NSU                 (0x1U<<0)
#define ACCESSCTRL_WATCHDOG_NSP                 (0x1U<<1)
#define ACCESSCTRL_WATCHDOG_SU                  (0x1U<<2)
#define ACCESSCTRL_WATCHDOG_SP                  (0x1U<<3)
#define ACCESSCTRL_WATCHDOG_CORE0               (0x1U<<4)
#define ACCESSCTRL_WATCHDOG_CORE1               (0x1U<<5)
#define ACCESSCTRL_WATCHDOG_DMA                 (0x1U<<6)
#define ACCESSCTRL_WATCHDOG_DBG                 (0x1U<<7)

// RSM Configuration

#define ACCESSCTRL_RSM_NSU                      (0x1U<<0)
#define ACCESSCTRL_RSM_NSP                      (0x1U<<1)
#define ACCESSCTRL_RSM_SU                       (0x1U<<2)
#define ACCESSCTRL_RSM_SP                       (0x1U<<3)
#define ACCESSCTRL_RSM_CORE0                    (0x1U<<4)
#define ACCESSCTRL_RSM_CORE1                    (0x1U<<5)
#define ACCESSCTRL_RSM_DMA                      (0x1U<<6)
#define ACCESSCTRL_RSM_DBG                      (0x1U<<7)

// XIP_CTRL Configuration

#define ACCESSCTRL_XIP_CTRL_NSU                 (0x1U<<0)
#define ACCESSCTRL_XIP_CTRL_NSP                 (0x1U<<1)
#define ACCESSCTRL_XIP_CTRL_SU                  (0x1U<<2)
#define ACCESSCTRL_XIP_CTRL_SP                  (0x1U<<3)
#define ACCESSCTRL_XIP_CTRL_CORE0               (0x1U<<4)
#define ACCESSCTRL_XIP_CTRL_CORE1               (0x1U<<5)
#define ACCESSCTRL_XIP_CTRL_DMA                 (0x1U<<6)
#define ACCESSCTRL_XIP_CTRL_DBG                 (0x1U<<7)

// XIP_QMI Configuration

#define ACCESSCTRL_XIP_QMI_NSU                  (0x1U<<0)
#define ACCESSCTRL_XIP_QMI_NSP                  (0x1U<<1)
#define ACCESSCTRL_XIP_QMI_SU                   (0x1U<<2)
#define ACCESSCTRL_XIP_QMI_SP                   (0x1U<<3)
#define ACCESSCTRL_XIP_QMI_CORE0                (0x1U<<4)
#define ACCESSCTRL_XIP_QMI_CORE1                (0x1U<<5)
#define ACCESSCTRL_XIP_QMI_DMA                  (0x1U<<6)
#define ACCESSCTRL_XIP_QMI_DBG                  (0x1U<<7)

// XIP_AUX Configuration

#define ACCESSCTRL_XIP_AUX_NSU                  (0x1U<<0)
#define ACCESSCTRL_XIP_AUX_NSP                  (0x1U<<1)
#define ACCESSCTRL_XIP_AUX_SU                   (0x1U<<2)
#define ACCESSCTRL_XIP_AUX_SP                   (0x1U<<3)
#define ACCESSCTRL_XIP_AUX_CORE0                (0x1U<<4)
#define ACCESSCTRL_XIP_AUX_CORE1                (0x1U<<5)
#define ACCESSCTRL_XIP_AUX_DMA                  (0x1U<<6)
#define ACCESSCTRL_XIP_AUX_DBG                  (0x1U<<7)
